Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/svd/PIC32CZ2051CA80100.svd
               <register>
                  <name>INTRRX</name>
                  <description>Read Only Register Which Indicates Which Interrupts Are Currently Active For RX EP1-15</description>
                  <addressOffset>0x1004</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>EP1RX</name>
                        <description>Interrupts Active For Which RX1 Endpoint</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP2RX</name>
                        <description>Interrupts Active For Which RX2 Endpoint</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP3RX</name>
                        <description>Interrupts Active For Which RX3 Endpoint</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP4RX</name>
                        <description>Interrupts Active For Which RX4 Endpoint</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP5RX</name>
                        <description>Interrupts Active For Which RX5 Endpoint</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP6RX</name>
                        <description>Interrupts Active For Which RX6 Endpoint</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP7RX</name>
                        <description>Interrupts Active For Which RX7 Endpoint</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTRTXE</name>
                  <description>Interrupt Enable Bits for INTRTX</description>
                  <addressOffset>0x1006</addressOffset>
                  <size>16</size>
                  <resetValue>0xFFFF</resetValue>
                  <fields>
                     <field>
                        <name>EP0TXEN</name>
                        <description>Interrupt Enabled for TX EP0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP1TXEN</name>
                        <description>Interrupt Enabled for TX EP1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP2TXEN</name>
                        <description>Interrupt Enabled for TX EP2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP3TXEN</name>
                        <description>Interrupt Enabled for TX EP3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP4TXEN</name>
                        <description>Interrupt Enabled for TX EP4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP5TXEN</name>
                        <description>Interrupt Enabled for TX EP5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP6TXEN</name>
                        <description>Interrupt Enabled for TX EP6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP7TXEN</name>
                        <description>Interrupt Enabled for TX EP7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTRRXE</name>
                  <description>Interrupt Enable Bits for INTRRX</description>
                  <addressOffset>0x1008</addressOffset>
                  <size>16</size>
                  <resetValue>0xFFFE</resetValue>
                  <fields>
                     <field>
                        <name>EP1RXE</name>
                        <description>Interrupt Enabled for RX EP1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP2RXE</name>
                        <description>Interrupt Enabled for RX EP2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP3RXE</name>
                        <description>Interrupt Enabled for RX EP3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP4RXE</name>
                        <description>Interrupt Enabled for RX EP4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP5RXE</name>
                        <description>Interrupt Enabled for RX EP5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP6RXE</name>
                        <description>Interrupt Enabled for RX EP6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP7RXE</name>
                        <description>Interrupt Enabled for RX EP7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTRUSB</name>
                  <description>Read Only Register Which Indicates Which USB Interrupts Are Currently Active.</description>
                  <addressOffset>0x100A</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SUSPEND</name>
                        <description>Set When Suspend Signal Is Detected On The Bus</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESUME</name>
                        <description>Set When Resume Signal Is Detected On The Bus</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESET</name>
                        <description>Set In Peripheral Mode when Reset Is Detected On The Bus. In HostMode When Babble Is Detected</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOF</name>
                        <description>Set When A New Frame Starts</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CONN</name>
                        <description>Set When A Device Connection Is Detected</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISCON</name>
                        <description>Set In Host Mode When A Device Disconnect Is Detected.Set In Peripheral Mode When A Session Ends</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SESSREQ</name>
                        <description>Set When Session Request Signaling Has Been Detected.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUSERR</name>
                        <description>Set When VBus Drops Below The VBus Valid Threshold During A Session.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTRUSBE</name>
                  <description>Interrupt Enable Bits for USB Interrupts</description>
                  <addressOffset>0x100B</addressOffset>
                  <size>8</size>
                  <resetValue>0x06</resetValue>
                  <fields>
                     <field>
                        <name>SUSPENDEN</name>
                        <description>SUSEPND Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESUMEEN</name>
                        <description>RESUME Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESETEN</name>
                        <description>RESET/BABBLE Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOFEN</name>
                        <description>SOF Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CONNEN</name>
                        <description>CONN Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISCONEN</name>
                        <description>DISCONN Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SESSREQEN</name>
                        <description>SESSREQ Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUSERREN</name>
                        <description>VBus Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FRAME</name>
                  <description>Holds The Last Received Frame Number</description>
                  <addressOffset>0x100C</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>FRMNUM</name>
                        <description>Frame Number</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INDEX</name>
                  <description>Index Is A 4-Bit Register That Determines Which Endpoint Control/Status Registers Are Accessed</description>
                  <addressOffset>0x100E</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SELEP</name>
                        <description>The Selected Endpoint</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>SELEPSelect</name>
                           <enumeratedValue>
                              <name>EP0</name>
                              <description>Endpoint 0 Select</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP1</name>
                              <description>Endpoint 1 Select</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP2</name>
                              <description>Endpoint 2 Select</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP3</name>
                              <description>Endpoint 3 Select</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP4</name>
                              <description>Endpoint 4 Select</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP5</name>
                              <description>Endpoint 5 Select</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP6</name>
                              <description>Endpoint 6 Select</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP7</name>
                              <description>Endpoint 7 Select</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP8</name>
                              <description>Endpoint 8 Select</description>
                              <value>0x8</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TESTMODE</name>
                  <description>Not Used In Normal Operation. Configuration To Put the USBCORE Into One Of The Four Test Modes For HighSpeed Operation</description>
                  <addressOffset>0x100F</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TESTSE0NAK</name>
                        <description>Set To Enter The Test_SE0_NAK mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TESTJ</name>
                        <description>Set To Enter The Test_J mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TESTK</name>
                        <description>Set To Enter The Test_K mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TESTPACKET</name>
                        <description>Set To Enter The Test_Packet mode</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FORCEHS</name>
                        <description>Depending On Bit 7 Force Controller Into High Speed Mode</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FORCEFS</name>
                        <description>Depending On Bit 7 Force Controller Into FS Speed Mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOACCESS</name>
                        <description>The CPU Sets This Bit To Transfer The Packet In The Endpoint 0 TX FIFO To The Endpoint 0 Rx FIFO. It Is Cleared Automatically.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FORCEHOST</name>
                        <description>The CPU Sets This Bit To Instruct The Core To Enter Host Mode When The Session Bit Is Set</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TXMAXP</name>
                  <description>ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected TX Endpoint In A Single Operation</description>
                  <addressOffset>0x1010</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>MAXPAYLOAD</name>
                        <description>Maximum Payload/Transactions</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>MULTIPLIER</name>
                        <description>Multiplier Value (m-1)</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TXCSRL_HOST_EPX_MODE</name>
                  <description>ENDPOINTX Control And Status Bits for TX Endpoints 1-15</description>
                  <addressOffset>0x1012</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TXPKTRDY</name>
                        <description>The CPU Sets This Bit After Loading A Data Packet Into The FIFO.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFONOTEMPTY</name>
                        <description>The USB Sets This Bit When There Is At Least 1 Packet In The TX FIFO.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FLUSHFIFO</name>
                        <description>The CPU Writes A 1 To This Bit To Flush The Latest Packet From The Endpoint TX FIFO</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SETUPPKT</name>
                        <description>The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXSTALL</name>
                        <description>This Bit Is Set When A Stall Handshake Is Received.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLRDATATOG</name>
                        <description>The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAKTIMEOUT</name>
                        <description>This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
